## Plan Result (nle - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * module.nle-hmcts-net.azurerm_role_assignment.dnszonecontributer
  * module.public-dns.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.nle-hmcts-net.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/nle.hmcts.net/providers/Microsoft.Authorization/roleAssignments/f575bb67-e80f-bc4d-b4d6-8b37640149f6" -> (known after apply)
      ~ name                                   = "f575bb67-e80f-bc4d-b4d6-8b37640149f6" -> (known after apply)
      ~ principal_id                           = "2cab9ccf-e755-4b58-a6b6-692705f3e79d" -> "/groups/2cab9ccf-e755-4b58-a6b6-692705f3e79d" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.public-dns.azurerm_role_assignment.dnszonecontributer must be replaced
-/+ resource "azurerm_role_assignment" "dnszonecontributer" {
      ~ id                                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/nle.platform.hmcts.net/providers/Microsoft.Authorization/roleAssignments/6e81fe88-7d2e-98ba-3113-6e99f9525e35" -> (known after apply)
      ~ name                                   = "6e81fe88-7d2e-98ba-3113-6e99f9525e35" -> (known after apply)
      ~ principal_id                           = "2cab9ccf-e755-4b58-a6b6-692705f3e79d" -> "/groups/2cab9ccf-e755-4b58-a6b6-692705f3e79d" # forces replacement
      ~ principal_type                         = "Group" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/providers/Microsoft.Authorization/roleDefinitions/befefa01-2a29-4197-83a8-272ff33ce314" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1856,"Program":"tfcmt","SHA1":"","Target":"nle - TerraformPlanApply","Vars":{}} -->